# PANDAS

In [1]:
import numpy as np
import pandas as pd

# Series Function
Series is a one dimensional labelled data structure

In [2]:
labels=['a','b','c','d']
my_data=[1,2,3,4]
arr=np.array(my_data)
di={'a':1,'b':2,'c':3,'d':4}

In [3]:
pd.Series(data=my_data)

0    1
1    2
2    3
3    4
dtype: int64

In [4]:
pd.Series(data=my_data,index=labels)

a    1
b    2
c    3
d    4
dtype: int64

In [5]:
pd.Series(arr)

0    1
1    2
2    3
3    4
dtype: int64

In [6]:
ser=pd.Series(di)

In [7]:
ser

a    1
b    2
c    3
d    4
dtype: int64

In [8]:
ser['a']

1

# DATAFRAMES
2 dimensional data structure

In [9]:
from numpy.random import randn
np.random.seed(101)

In [10]:
df = pd.DataFrame(randn(5,4),["A","B","C","D","E"],["W","X","Y","Z"])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [11]:
df["W"]

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [12]:
df[["W","X"]]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [13]:
df["NEW"] = df["X"]+df["Y"]
df

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109
E  0.190794  1.978757  2.605967  0.683509  4.584725

In [14]:
df.drop("NEW",axis=1,inplace=True)

In [15]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [16]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [17]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [18]:
df.loc["B","Y"]

-0.8480769834036315

In [19]:
df.loc[["A","B"],["X","Y"]]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077

In [20]:
booldf = df >0
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [21]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [22]:
df["W"]>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [23]:
df[df["W"]>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [24]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [25]:
df[df["Z"]<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [26]:
df[df["X"]>0]["Y"]

A    0.907969
C    0.528813
E    2.605967
Name: Y, dtype: float64

In [27]:
df[(df["X"]>0)&(df["Y"]>0)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [28]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [29]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [30]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [31]:
newInd = "DEL UP UK GUJ HP".split()
newInd

['DEL', 'UP', 'UK', 'GUJ', 'HP']

In [32]:
df["STATES"] = newInd
df

          W         X         Y         Z STATES
A  2.706850  0.628133  0.907969  0.503826    DEL
B  0.651118 -0.319318 -0.848077  0.605965     UP
C -2.018168  0.740122  0.528813 -0.589001     UK
D  0.188695 -0.758872 -0.933237  0.955057    GUJ
E  0.190794  1.978757  2.605967  0.683509     HP

In [33]:
df.set_index("STATES")

               W         X         Y         Z
STATES
DEL     2.706850  0.628133  0.907969  0.503826
UP      0.651118 -0.319318 -0.848077  0.605965
UK     -2.018168  0.740122  0.528813 -0.589001
GUJ     0.188695 -0.758872 -0.933237  0.955057
HP      0.190794  1.978757  2.605967  0.683509

# Index levels

In [40]:
outside = ["G1","G1","G1","G2","G2","G2"]
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [41]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [44]:
d=pd.DataFrame(randn(6,2),hier_index,["A","B"])

In [46]:
d

             A         B
G1 1 -0.497104 -0.754070
   2 -0.943406  0.484752
   3 -0.116773  1.901755
G2 1  0.238127  1.996652
   2 -0.993263  0.196800
   3 -1.136645  0.000366

In [48]:
d.loc["G1"].loc[1]

A   -0.497104
B   -0.754070
Name: 1, dtype: float64

In [51]:
d.index.names=["GROUP","NUM"]
d

                  A         B
GROUP NUM
G1    1   -0.497104 -0.754070
      2   -0.943406  0.484752
      3   -0.116773  1.901755
G2    1    0.238127  1.996652
      2   -0.993263  0.196800
      3   -1.136645  0.000366

In [52]:
d.xs(1,level="NUM")

              A         B
GROUP
G1    -0.497104 -0.754070
G2     0.238127  1.996652